[Survived] BlockStatement
src/application/controllers/person.ts:6:33
 }
 
 export class PersonController implements Speaker {
-  speak (name?: string): string {
-    return `Olá, ${name?.toLocaleUpperCase() ?? 'fulado'}!`
-  }
+  speak (name?: string): string {}
 }
 

[Survived] LogicalOperator
src/application/controllers/person.ts:7:20
 
 export class PersonController implements Speaker {
   speak (name?: string): string {
-    return `Olá, ${name?.toLocaleUpperCase() ?? 'fulado'}!`
+    return `Olá, ${name?.toLocaleUpperCase() && 'fulado'}!`
   }
 }

[Survived] OptionalChaining
src/application/controllers/person.ts:7:20
 
 export class PersonController implements Speaker {
   speak (name?: string): string {
-    return `Olá, ${name?.toLocaleUpperCase() ?? 'fulado'}!`
+    return `Olá, ${name.toLocaleUpperCase() ?? 'fulado'}!`
   }
 }
