[Survived] BlockStatement
src/main/api/index.ts:5:27
 import { PersonController, type Speaker } from '@/application/controllers'
 
 class Server {
-  init (speaker: Speaker) {
-    console.log(speaker.speak('Douglas'))
-    console.log(speaker.speak())
-  }
+  init (speaker: Speaker) {}
 }
 

[Survived] StringLiteral
src/main/api/index.ts:6:31
 
 class Server {
   init (speaker: Speaker) {
-    console.log(speaker.speak('Douglas'))
+    console.log(speaker.speak(""))
     console.log(speaker.speak())
   }
